# AddInCommandBinding Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
AddInCommandBinding Properties
AddInCommandBinding Class See Also
---
The AddInCommandBinding type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| RevitCommandId | The Revit command Id. |

# See Also
AddInCommandBinding Class
Autodesk.Revit.UI Namespace